prop/stator/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    Inlet
    {
        type            inletOutlet;
		inletValue		$internalField;
        value           $internalField;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    Side
    {
        type            kqRWallFunction;
        value           $internalField;
    }
	AMI2
	{
		type			cyclicAMI;
		value			$internalField;
	}
	propeller
	{
		type			kqRWallFunction;
		value			$internalField;
	}
	AMI1
	{
		type			cyclicAMI;
		value			$internalField;
	}
}
// ************************************************************************* //
